app/controllers/application_controller.rb

INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2023-11-23 21:32:40.008062"], ["updated_at", "2023-11-23 21:32:40.008062"], ["user_id", 1]]
---
    def check_and_create_cart
      if current_user.cart.nil?
        current_user.create_cart