app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 40]]
---
  def destroy
    @cart.destroy!