app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

  def create
    #@lineitem = Lineitem.new(lineitem_params)

    @lineitem = @cart.add_item(params[:product_id])

    respond_to do |format|
      if @lineitem.save
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2023-11-23 21:32:40.008062"], ["updated_at", "2023-11-23 21:32:40.008062"], ["user_id", 1]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["product_id", 9], ["cart_id", 11], ["created_at", "2023-11-23 18:37:30.568587"], ["updated_at", "2023-11-23 18:37:30.568587"], ["quantity", 1], ["order_id", nil]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2023-11-23 00:49:08.748695"], ["quantity", 3], ["id", 8]]