app/controllers/orders_controller.rb

  def new
    if @cart.lineitems.empty?
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 8]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 19], ["LIMIT", 1]]

  def create
    # add order_id in lineitems
    @order = Order.new(order_params)

    @order.add_order_id_in_lineitems(@cart)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("name", "address", "text", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "ii"], ["address", "alfjj"], ["text", nil], ["email", "ii@gmail.com"], ["paytype", "Check"], ["created_at", "2023-11-23 20:59:27.146331"], ["updated_at", "2023-11-23 20:59:27.146331"]]

    def clear_cart
      @cart.lineitems.destroy_all # Remove all line items associated with the cart
---
DELETE FROM "lineitems" WHERE "lineitems"."id" = ?  [["id", 16]]