app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "new"], ["description", "desc"], ["image", ""], ["price", nil], ["created_at", "2023-11-22 03:15:51.018733"], ["updated_at", "2023-11-22 03:15:51.018733"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE (name LIKE '%lily%' OR description LIKE '%lily%')
---
  def search
    # @cart = current_user.cart
    if user_signed_in?
      @cart = current_user.cart
    else
      @cart = Cart.new # or any default behavior for non-logged-in users
    end
    @query = params[:query]
    @min_price = params[:min_price]
    @max_price = params[:max_price]

    # Build the query dynamically based on provided parameters
    query = Product.all