app/controllers/shopper_controller.rb

  def index
    @allproducts = Product.order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

  def show_product
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]