app/models/order.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 12]]
---
    def add_order_id_in_lineitems(cart)
        cart.lineitems.each do |item|