app/controllers/concerns/current_cart.rb

    def set_cart
        @cart = Cart.find(session[:cart_id])
    rescue ActiveRecord::RecordNotFound
        @cart = Cart.create()
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2023-11-23 20:29:00.318996"], ["updated_at", "2023-11-23 20:29:00.318996"], ["user_id", nil]]